Revit 2015 API
RevitLinkType.Load Method
 Loads or reloads the Revit link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public RevitLinkLoadResult Load()
Visual Basic
Public Function Load As RevitLinkLoadResult
Visual C++
public:
RevitLinkLoadResult^ Load()
Return Value
 An object containing the ElementId of the link and an enum value indicating any errors which occurred while trying to load. RevitLinkLoadResultType.LinkLoaded indicates success.
Remarks
If the link is currently loaded, Revit must unload the link before reloading it. Any changes made in-memory to the link's shared coordinates will be discarded.
This function regenerates the document.
The document's Undo history will be cleared by this command. As a result, this command and others executed before it cannot be undone. All transaction phases (e.g. transactions transaction groups and sub-transaction) that were explicitly started must be finished prior to calling this method.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.FileAccessException |  The model cannot be accessed due to lack of access privileges.
Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException |  The function is not permitted during dynamic update.
Autodesk.Revit.Exceptions.InvalidOperationException |  This RevitLinkType is not a top-level link. -or- The link "this RevitLinkType" is loaded into multiple documents and cannot be reloaded. -or- The element "this RevitLinkType" is in a closed workset. -or- There was a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method. -or- The document is read-only. It cannot be modified. -or- The document is in an edit mode or is in family mode.
See Also
RevitLinkType Class
Autodesk.Revit.DB Namespace